{
  "backend/main.mo": "Main Motoko actor implementing user profiles, crochet patterns, and project management with role-based access control (admin/user) and blob storage integration.",
  "feature_evidence.json": "Feature evidence report documenting SEO and social media meta tag implementations across frontend/index.html and semantic HTML updates in key page components.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend TypeScript/React components, pages, hooks, and configuration files describing their functionality and structure.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining design tokens for backgrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, Open Graph tags, Twitter Card tags, canonical link, and JSON-LD structured data for the Crochet Craft Hub web application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, tutorials, projects, publishing, and tracking pages, wrapped in ThemeProvider and Layout.",
  "frontend/src/components/ActiveProjectCard.tsx": "Card component displaying user's active project with thumbnail, progress bar, time spent, and action buttons for updating progress or viewing details.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component rendering a full-width image with gradient overlay and welcome text for the application landing page.",
  "frontend/src/components/ImageUploader.tsx": "A React component for uploading and managing multiple images with drag-and-drop support, progress tracking, and preview thumbnails. Handles file validation, upload progress display, and image removal with a configurable maximum image limit.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that includes navigation header and footer with social media links, quick navigation, and branding. Provides consistent page structure across the application with responsive grid layout.",
  "frontend/src/components/MaterialsInput.tsx": "Dynamic form component for adding, editing, and removing materials with fields for name, quantity, and unit. Displays materials in cards with validation and empty state messaging.",
  "frontend/src/components/MaterialsList.tsx": "Read-only table component that displays a list of materials with their quantities and units. Returns null if no materials are provided.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with authentication controls, mobile menu toggle, and conditional links based on login state. Integrates with Internet Identity for authentication and triggers profile setup modal for new users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile creation with name and bio fields. Non-dismissible modal that saves profile data using mutation hook and displays toast notifications.",
  "frontend/src/components/ProgressBar.tsx": "Visual progress indicator component that displays a percentage value with color-coded styling based on completion level. Uses a progress bar with accompanying text label.",
  "frontend/src/components/ProjectCard.tsx": "Clickable card component displaying project summary with thumbnail image, title, creator name, description, and completion badges. Navigates to project detail page on click and fetches creator profile data.",
  "frontend/src/components/TutorialCard.tsx": "Card component for displaying crochet pattern tutorials with step count and material count. Includes a book icon and navigates to tutorial detail page when clicked.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, crochet patterns, and projects, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, craft-inspired color palette for both light and dark modes using HSL color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page component displaying a hero section and feature cards for tutorials, project sharing, progress tracking, and materials guides with navigation to relevant sections.",
  "frontend/src/pages/MyProjectsPage.tsx": "Displays authenticated user's crochet projects in a grid layout with loading states, empty state handling, and navigation to create new projects.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Shows detailed view of a single project including images carousel, creator info, completion progress, time spent, description, instructions, and materials list.",
  "frontend/src/pages/ProjectsGalleryPage.tsx": "Displays a grid gallery of all community crochet projects using useGetAllProjects hook, with loading skeletons and an empty state.",
  "frontend/src/pages/PublishProjectPage.tsx": "Form page for publishing new crochet projects with fields for title, description, instructions, images (via ImageUploader), and materials, using useAddProject mutation.",
  "frontend/src/pages/TrackProjectPage.tsx": "Page for updating project progress including completion percentage slider, time spent input, and image management, using useUpdateProject mutation.",
  "frontend/src/pages/TutorialDetailPage.tsx": "Displays detailed view of a single crochet pattern/tutorial with materials list and numbered step-by-step instructions using useGetPattern hook.",
  "frontend/src/pages/TutorialsPage.tsx": "Grid view of all available crochet patterns/tutorials using useGetPatterns hook, with loading skeletons and empty state.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme for shadcn/ui components, custom fonts (Inter and Playfair Display), and animation utilities.",
  "project_state.json": "Project state file defining a free crocheting app with tutorials, project publishing, progress tracking, and materials lists. Includes architectural notes about no payment system and SEO optimization, plus detailed feature definitions for UI design, social media integration, and structured data."
}