{
  "backend/main.mo": "Main Motoko actor implementing user profiles, crochet projects, tutorials, patterns, and materials management with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three Navigation component debugging and re-render features related to admin state and authentication changes.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend TypeScript/React files including pages, components, and hooks with semantic HTML and authentication details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using oklch color space.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, Open Graph, Twitter cards, JSON-LD structured data, and canonical URL for Crochet Craft Hub.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, tutorials, projects, admin pages) wrapped in Layout with ThemeProvider and Toaster.",
  "frontend/src/components/ActiveProjectCard.tsx": "Card component displaying user's active project with thumbnail, progress bar, time spent, and buttons to update progress or view details.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component rendering generated hero image with gradient overlay and welcome heading for the home page.",
  "frontend/src/components/ImageUploader.tsx": "A React component for uploading multiple images with drag-and-drop support, preview thumbnails, progress tracking, and removal functionality. Uses ExternalBlob for file handling and enforces a configurable maximum image limit.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that includes navigation header and footer with social links, quick navigation, and branding. Footer includes attribution to caffeine.ai and displays current year.",
  "frontend/src/components/MaterialsInput.tsx": "Form component for managing a dynamic list of materials with name, quantity, and unit fields. Provides add/remove functionality and displays empty state when no materials are added.",
  "frontend/src/components/MaterialsList.tsx": "Read-only display component that renders a table of materials with their quantities and units. Returns null if no materials are provided.",
  "frontend/src/components/Navigation.tsx": "Navigation bar component with authentication integration, responsive mobile menu, and dynamic links based on user role (including admin access). Handles login/logout and triggers profile setup modal for new users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile creation with name (required) and bio (optional) fields. Cannot be dismissed and uses mutation hook to save profile data.",
  "frontend/src/components/ProgressBar.tsx": "Simple progress bar component that displays a percentage value with color-coded styling based on completion level (red to green gradient).",
  "frontend/src/components/ProjectCard.tsx": "Card component displaying project summary with thumbnail image, title, creator name, description, and completion badges. Navigates to project detail page on click.",
  "frontend/src/components/TutorialCard.tsx": "Card component for displaying tutorial overview with icon, title, step/material counts, difficulty badge, and description. Includes click navigation to tutorial detail page.",
  "frontend/src/components/TutorialForm.tsx": "A React form component for creating and editing tutorials with fields for title, description, difficulty, steps, and materials. Supports dynamic addition/removal of steps and materials, with validation and disabled title editing for existing tutorials.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state using DFINITY's AuthClient. Includes a provider component and useInternetIdentity hook for accessing identity and authentication status throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, admin checks, and tutorial CRUD operations. Each hook uses the actor from useActor and manages query/mutation state with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, craft-inspired color palette for both light and dark modes. Includes terracotta primary colors, sage green accents, and warm beige tones.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminCreatePage.tsx": "Admin page for creating new tutorials with access control checks. Renders TutorialForm and handles tutorial creation via useCreateTutorial mutation with success/error toasts.",
  "frontend/src/pages/AdminEditPage.tsx": "Admin page for editing existing tutorials identified by title URL parameter. Fetches tutorial data, enforces admin access control, and handles updates via useUpdateTutorial mutation.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page for managing tutorials with create, edit, and delete functionality. Includes access control checks and confirmation dialogs for destructive actions.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying hero section and four feature cards (Learn & Create, Share Your Work, Track Progress, Materials Guide) with navigation to key app sections. Includes call-to-action section with background image.",
  "frontend/src/pages/MyProjectsPage.tsx": "Authenticated user's project list page showing active projects in a grid layout. Displays empty state with call-to-action when no projects exist and requires login to access.",
  "frontend/src/pages/ProjectDetailPage.tsx": "Detailed view of a single project showing title, creator info, time spent, completion percentage, image carousel, and materials list. Fetches project by title parameter from URL.",
  "frontend/src/pages/ProjectsGalleryPage.tsx": "Public gallery page displaying all community projects in a grid layout with loading skeletons and empty state. Shows project cards for browsing shared crochet creations.",
  "frontend/src/pages/PublishProjectPage.tsx": "Form page for creating and publishing new crochet projects with fields for title, description, instructions, images (up to 5), and materials. Validates required fields and navigates to my-projects on success.",
  "frontend/src/pages/TrackProjectPage.tsx": "Page component for updating project progress with completion percentage slider, time spent input, and image uploader; fetches project by title from URL params and submits updates via mutation.",
  "frontend/src/pages/TutorialDetailPage.tsx": "Detail page displaying a single tutorial with materials list and step-by-step instructions; fetches tutorial by name from URL params with loading and error states.",
  "frontend/src/pages/TutorialsPage.tsx": "Landing page displaying a grid of tutorial cards with header and empty state; uses useGetTutorials hook to fetch and render all available tutorials.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography with Inter and Playfair Display fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a free crochet app with tutorials, project publishing, progress tracking, and materials lists; notes a known issue with admin navigation link not appearing after Internet Identity login."
}