{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add comprehensive SEO enhancements for search engine discoverability",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Add meta tags to frontend/index.html for search engine optimization with crochet-specific keywords",
      "acceptanceCriteria": [
        "HTML head contains descriptive meta title tag",
        "Meta description tag accurately describes the app's core features",
        "Meta keywords tag includes relevant crochet and crafting terms"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add meta title, description, and keywords tags optimized for 'Crochet Craft Hub' featuring crochet tutorials, project sharing, progress tracking, and crafting community. Include keywords such as 'crochet patterns', 'crochet tutorials', 'craft projects', 'yarn crafts', 'handmade', 'DIY crochet', 'crochet community', 'project tracking', and 'materials guide'."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Implement Open Graph meta tags in frontend/index.html for rich social media previews on Facebook and LinkedIn",
      "acceptanceCriteria": [
        "All required Open Graph tags are present in HTML head",
        "og:image points to a suitable preview image for the crocheting app",
        "Social media platforms display rich previews when the app URL is shared"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add Open Graph meta tags including og:title (Crochet Craft Hub), og:description (describing tutorials, project sharing, and community features), og:type (website), og:url (canonical app URL), and og:image pointing to the generated social preview image at frontend/public/assets/generated/og-preview.dim_1200x630.png. Ensure the image path uses the workspace location with dimension suffix."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add Twitter Card meta tags in frontend/index.html for enhanced Twitter previews",
      "acceptanceCriteria": [
        "Twitter Card tags are properly formatted in HTML head",
        "Card type is set to summary_large_image for visual appeal",
        "Twitter displays preview card when app URL is shared"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add Twitter Card meta tags including twitter:card (summary_large_image), twitter:title (Crochet Craft Hub), twitter:description (describing app features), and twitter:image pointing to the generated social preview image at frontend/public/assets/generated/og-preview.dim_1200x630.png. Use the same image as Open Graph for consistency."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add JSON-LD structured data markup to frontend/index.html defining the app as a WebApplication",
      "acceptanceCriteria": [
        "Valid JSON-LD script tag is present in HTML",
        "Schema type is set to WebApplication",
        "Structured data validates using Google's Rich Results Test",
        "Free access is clearly indicated in the offers property"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add a JSON-LD script tag with schema.org WebApplication vocabulary including @type: 'WebApplication', name: 'Crochet Craft Hub', description (comprehensive feature description), applicationCategory: 'LifestyleApplication', and offers property with @type: 'Offer', price: '0', priceCurrency: 'USD' to indicate free access. Include url property pointing to the canonical app URL."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Update semantic HTML elements across key pages to use proper heading hierarchy and ARIA landmarks",
      "acceptanceCriteria": [
        "Each page has exactly one h1 tag representing the main heading",
        "Heading hierarchy follows logical order without skipping levels",
        "Main content areas use appropriate semantic HTML5 elements (main, article, section, nav)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure the page has exactly one h1 tag for the main heading (e.g., 'Welcome to Crochet Craft Hub'), wrap the main content in a <main> element, use <section> elements for feature cards area, and ensure heading hierarchy progresses logically (h1 → h2 → h3) without skipping levels. Verify that semantic HTML5 elements are used appropriately."
        },
        {
          "path": "frontend/src/pages/TutorialsPage.tsx",
          "operation": "modify",
          "description": "Add an h1 tag as the main page heading (e.g., 'Crochet Tutorials & Patterns'), wrap the tutorials grid in a <main> element, and ensure any subsection headings use h2 tags. Verify proper semantic structure with article or section elements for tutorial listings."
        },
        {
          "path": "frontend/src/pages/ProjectsGalleryPage.tsx",
          "operation": "modify",
          "description": "Add an h1 tag as the main page heading (e.g., 'Community Projects Gallery'), wrap the projects grid in a <main> element, and ensure the heading hierarchy is logical. Use semantic HTML5 elements (section, article) to structure the project gallery content."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add a canonical link tag in frontend/index.html to prevent duplicate content issues",
      "acceptanceCriteria": [
        "Canonical link tag is present in HTML head",
        "Tag points to the primary app URL"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add a canonical link tag in the HTML head section with rel='canonical' and href pointing to the primary production URL of the Crochet Craft Hub application to prevent duplicate content issues when the app is accessible via multiple URLs."
        }
      ]
    }
  ]
}