{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Navigation component to properly detect authentication state changes and display Admin link",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Update the Navigation component to add useEffect hooks that explicitly watch for changes in the identity state from useInternetIdentity and trigger the useIsCallerAdmin query to refetch when authentication status changes from logged out to logged in",
      "acceptanceCriteria": [
        "Navigation component includes a useEffect that depends on identity state from useInternetIdentity",
        "When identity changes from null/anonymous to authenticated, the useIsCallerAdmin query is triggered to refetch",
        "The Admin link appears in the navigation bar immediately after successful Internet Identity login for admin users",
        "Console logs confirm the identity state change is detected and the admin check runs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add a useEffect hook that watches the identity state from useInternetIdentity. When identity transitions from null/anonymous to authenticated, log the state change to console and trigger the useIsCallerAdmin query refetch. Include dependency array with identity to ensure the effect runs on authentication status changes."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Ensure the useIsCallerAdmin query in the Navigation component is properly enabled and configured to run immediately when the identity state becomes authenticated, using the enabled option based on identity presence",
      "acceptanceCriteria": [
        "useIsCallerAdmin query has an enabled option that returns true only when identity is authenticated",
        "Query automatically runs when enabled state changes from false to true",
        "Query does not attempt to run when user is not authenticated",
        "Admin link visibility updates immediately when query returns successful result"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Update the useIsCallerAdmin query configuration to include an enabled option that checks for authenticated identity presence. Ensure the query only runs when the user has a valid identity and the actor is available. Configure the query to automatically execute when the enabled state transitions from false to true."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Add refetch mechanism in Navigation component that manually triggers the useIsCallerAdmin query refetch when the actor instance changes or identity updates, ensuring the admin status check runs with the newly authenticated identity",
      "acceptanceCriteria": [
        "Navigation component accesses the refetch function from the useIsCallerAdmin query",
        "Component triggers refetch when identity transitions from unauthenticated to authenticated",
        "Admin link appears in navigation within 1-2 seconds after successful login",
        "No race conditions occur where the query runs with stale or anonymous identity"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Extract the refetch function from the useIsCallerAdmin query hook. In the useEffect that watches identity changes, call refetch() when the identity becomes authenticated to immediately trigger the admin status check with the new identity. Ensure proper sequencing to avoid race conditions with actor initialization."
        }
      ]
    }
  ]
}